InformationRegisters/ЛБ_СогласияНаИнформирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СогласияНаИнформирование</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыСогласийНаИнформирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибочное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЛБ_ФормаРасторженияСогласияНаИнформирование/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Клиент") Тогда
         Клиент = Параметры.Клиент;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьИнформациюОСогласии(Клиент)	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Клиент.ДатаРождения КАК КлиентДатаРождения,
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Период КАК ДатаЗаключения,
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.Ломбард КАК Ломбард,
		|	ЛБ_СогласияНаИнформированиеСрезПоследних.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ЛБ_СогласияНаИнформирование.СрезПоследних(&ТекущаяДата, Клиент = &Клиент) КАК ЛБ_СогласияНаИнформированиеСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураДанных = Новый Структура;
		ДанныеКлиента = ЛБ_СоглашенияЭДОСервер.ДанныеКлиента(Клиент, Выборка.ДатаЗаключения);
		СтруктураДанных.Вставить("ДатаРождения",   Формат(ДанныеКлиента.ДатаРождения, "ДФ=dd.MM.yyyy"));
		СтруктураДанных.Вставить("ДатаЗаключения", Выборка.ДатаЗаключения);
		СтруктураДанных.Вставить("Ломбард",        Выборка.Ломбард);
		СтруктураДанных.Вставить("ДатаОкончания",  Выборка.ДатаОкончания);
		Возврат СтруктураДанных;
	КонецЕсли;
	
КонецФункции // ЗаполнитьИнформациюОбЭДО()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СтруктураДанных = ЗаполнитьИнформациюОСогласии(Клиент);
	Элементы.НадписьФИОКлиента.Заголовок = Строка(Клиент) + ", дата рождения " + Формат(СтруктураДанных.ДатаРождения, "ДЛФ=DD");
	Заключено                            = Строка(СтруктураДанных.ДатаЗаключения);
	ВЛомбарде                            = Строка(СтруктураДанных.Ломбард);
	ДействуетПо                          = Строка(Формат(СтруктураДанных.ДатаОкончания, "ДФ=dd.MM.yyyy"));
КонецПроцедуры

&НаКлиенте
Процедура Да(Команда)
	//ЛБ_СоглашенияЭДОКлиент.РасторгнутьЭДОКлиент(Клиент, ЭтаФорма);
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Нет(Команда)
	ЭтаФорма.Закрыть(Ложь);
КонецПроцедуры
